In [1]:
import pandas as pd

1 Membuat data dalam bentuk Dictionary bernama "data" dengan keys : ```Nama``` , ```Usia``` , ```Kota```
---

In [2]:
data = {
    "Nama" : ['Arbyn','Thoriq','Afri','Army','Jundy','Agung','Bintang','Iqbal','Ramdan','reiven','Theo','Mimi','Evan','Muy','Toni','Alam','Marko','Felix','Rama','Rani'],
    "Usia" : [28,32,20,25,35,45,18,27,15,30,29,26,27,31,29,23,37,25,27,33],
    "Kota" : ['Medan','Padang','Samosir','Surabaya','Bogor','Jakarta','Riau','Bogor','Bogor','Medan','Medan','Padang','Jakarta','Palembang','Sumedang','Depok','Semarang','Jakarta','Medan','Surabaya']
}

2 Membuat dataFrame dari data yang ada pada Dictionary dan menampilkannya :
---

In [4]:
data_from_dict = pd.DataFrame(data)
print(data_from_dict)

       Nama  Usia       Kota
0     Arbyn    28      Medan
1    Thoriq    32     Padang
2      Afri    20    Samosir
3      Army    25   Surabaya
4     Jundy    35      Bogor
5     Agung    45    Jakarta
6   Bintang    18       Riau
7     Iqbal    27      Bogor
8    Ramdan    15      Bogor
9    reiven    30      Medan
10     Theo    29      Medan
11     Mimi    26     Padang
12     Evan    27    Jakarta
13      Muy    31  Palembang
14     Toni    29   Sumedang
15     Alam    23      Depok
16    Marko    37   Semarang
17    Felix    25    Jakarta
18     Rama    27      Medan
19     Rani    33   Surabaya

3 Menampilkan 5 baris pertama dari dataFrame :
---

In [5]:
data_from_dict.head()

     Nama  Usia      Kota
0   Arbyn    28     Medan
1  Thoriq    32    Padang
2    Afri    20   Samosir
3    Army    25  Surabaya
4   Jundy    35     Bogor

4 Menambahkan series/kolom baru : ```Gender``` , ```Alamat``` , ```Pekerjaan``` dan menampilkannya
---

In [7]:
data_from_dict['Gender'] = ['Male','Male','Male','Male','Male','Male','Male','Male','Male','Male','Male','Female','Male','Male','Male','Male','Male','Male','Female','Female']
data_from_dict['Alamat'] = ['Jalan ke-1','Jalan ke-2','Jalan ke-3','Jalan ke-4','Jalan ke-5','Jalan ke-6','Jalan ke-7','Jalan ke-8','Jalan ke-9','Jalan ke-10','Jalan ke-11','Jalan ke-12','Jalan ke-13','Jalan ke-14','Jalan ke-15','Jalan ke-16','Jalan ke-17','Jalan ke-18','Jalan ke-19','Jalan ke-20']
data_from_dict['Pekerjaan'] = ['Teacher','Engineer','Production Leader','Designer','Administrator','Web Developer','Data Analyst','Athlet','IT Support','Teacher','Designer','QA Analyst','Surveyor','Project Team Leader','Engineer','Data Analyst','Diver','Tour Guide','Athlet','QA Analyst']
print(data_from_dict)

       Nama  Usia       Kota  Gender       Alamat            Pekerjaan
0     Arbyn    28      Medan    Male   Jalan ke-1              Teacher
1    Thoriq    32     Padang    Male   Jalan ke-2             Engineer
2      Afri    20    Samosir    Male   Jalan ke-3    Production Leader
3      Army    25   Surabaya    Male   Jalan ke-4             Designer
4     Jundy    35      Bogor    Male   Jalan ke-5        Administrator
5     Agung    45    Jakarta    Male   Jalan ke-6        Web Developer
6   Bintang    18       Riau    Male   Jalan ke-7         Data Analyst
7     Iqbal    27      Bogor    Male   Jalan ke-8               Athlet
8    Ramdan    15      Bogor    Male   Jalan ke-9           IT Support
9    reiven    30      Medan    Male  Jalan ke-10              Teacher
10     Theo    29      Medan    Male  Jalan ke-11             Designer
11     Mimi    26     Padang  Female  Jalan ke-12           QA Analyst
12     Evan    27    Jakarta    Male  Jalan ke-13             Surveyor
13      Muy    31  Palembang    Male  Jalan ke-14  Project Team Leader
14     Toni    29   Sumedang    Male  Jalan ke-15             Engineer
15     Alam    23      Depok    Male  Jalan ke-16         Data Analyst
16    Marko    37   Semarang    Male  Jalan ke-17                Diver
17    Felix    25    Jakarta    Male  Jalan ke-18           Tour Guide
18     Rama    27      Medan  Female  Jalan ke-19               Athlet
19     Rani    33   Surabaya  Female  Jalan ke-20           QA Analyst

5 Filter data ```Usia > 25```
---

In [8]:
filtered = data_from_dict[data_from_dict['Usia'] > 25]
filtered

      Nama  Usia       Kota  Gender       Alamat            Pekerjaan
0    Arbyn    28      Medan    Male   Jalan ke-1              Teacher
1   Thoriq    32     Padang    Male   Jalan ke-2             Engineer
4    Jundy    35      Bogor    Male   Jalan ke-5        Administrator
5    Agung    45    Jakarta    Male   Jalan ke-6        Web Developer
7    Iqbal    27      Bogor    Male   Jalan ke-8               Athlet
9   reiven    30      Medan    Male  Jalan ke-10              Teacher
10    Theo    29      Medan    Male  Jalan ke-11             Designer
11    Mimi    26     Padang  Female  Jalan ke-12           QA Analyst
12    Evan    27    Jakarta    Male  Jalan ke-13             Surveyor
13     Muy    31  Palembang    Male  Jalan ke-14  Project Team Leader
14    Toni    29   Sumedang    Male  Jalan ke-15             Engineer
16   Marko    37   Semarang    Male  Jalan ke-17                Diver
18    Rama    27      Medan  Female  Jalan ke-19               Athlet
19    Rani    33   Surabaya  Female  Jalan ke-20           QA Analyst

6 Filter data : ```Usia > 30``` & ```Gender  == Female```
---

In [9]:
filtered = data_from_dict[(data_from_dict['Usia'] > 30) & (data_from_dict['Gender'] == 'Female')]
filtered

    Nama  Usia      Kota  Gender       Alamat   Pekerjaan
19  Rani    33  Surabaya  Female  Jalan ke-20  QA Analyst

7 Akses baris ke-3 dan ke-4 menggunakan ```.loc``` dan ```.iloc```
---

- ```.loc``` Label-based Indexing

In [14]:
data_from_dict.loc[3:4]

    Nama  Usia      Kota Gender      Alamat      Pekerjaan
3   Army    25  Surabaya   Male  Jalan ke-4       Designer
4  Jundy    35     Bogor   Male  Jalan ke-5  Administrator

In [18]:
data_from_dict.loc[[3,4]]

    Nama  Usia      Kota Gender      Alamat      Pekerjaan
3   Army    25  Surabaya   Male  Jalan ke-4       Designer
4  Jundy    35     Bogor   Male  Jalan ke-5  Administrator

- ```.iloc``` Integer-based Indexing

In [20]:
data_from_dict.iloc[3:5]

    Nama  Usia      Kota Gender      Alamat      Pekerjaan
3   Army    25  Surabaya   Male  Jalan ke-4       Designer
4  Jundy    35     Bogor   Male  Jalan ke-5  Administrator

8 Menghitung rata-rata "Usia"
---

In [24]:
average_age = data_from_dict['Usia'].mean()
print("Rata-rata usia adalah : " + str(average_age))

Rata-rata usia adalah : 28.1

9 Export dataFrame ke format .csv
---

In [26]:
data_from_dict.to_csv(path_or_buf="./data_pandas.csv", index= False)